test/performance-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5 
  http:
    request:
      headers:
        Content-Type: application/json

scenarios:
  - flow:
      - get:
          url: "/api/items" 
      - post:
          url: "/api/items"
          json:
            name: "Item {{ $randomInt(1, 1000) }}"
            description: "Performance test item"